//ДвухзначноеЧисло = 50;
//Степень = 3;
//ГраничноеЗначение = 10000; 

//Результат = 1;

//Для Индекс = 1 по Степень Цикл
//	Результат = Результат * ДвухзначноеЧисло;
//КонецЦикла;
//Сообщить(Результат); 

//Результат2 = Pow(ДвухЗначноеЧисло,Степень);

//Сообщить(Результат2);

//Если Результат>ГраничноеЗначение тогда
//	Сообщить ("Результат превышает граничное значение");
//Иначе
//	Сообщить ("Результат не превышает граничное значение");
//КонецЕсли;


//КонецГода = КонецГода(ТекущаяДата());

//Для Индекс = 1 по 10 Цикл
	//ДеньНедели= ДеньНедели(КонецГода);
	
	//Если ДеньНедели = 1 тогда
		//Сообщить ("Эх,Понедельник...");
	//ИначеЕсли ДеньНедели = 2 тогда 
		//Сообщить ("Ну такое себе,Вторник");
	//ИначеЕсли ДеньНедели = 3 тогда 
		//Сообщить ("Уже лучше,Среда");
	//ИначеЕсли ДеньНедели = 4 тогда 
		//Сообщить ("Еще чуть-чуть,Четверг");
	//ИначеЕсли ДеньНедели = 5 тогда 
		//Сообщить ("Ура,Тяпница");
	//ИначеЕсли ДеньНедели = 6 тогда 
		//Сообщить ("Суббота");
	//Иначе
		//Сообщить ("Воскресенье");
	//КонецЕсли;
	
	//КонецГода = КонецГода (КонецДня(КонецГода)+1);
	//КонецЦикла;
	
	
